---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureSeverity.Warning
enum: Autodesk.Revit.DB.FailureSeverity
zh: 警告
source: html/d0cdffe3-22c5-b764-8090-5104f044b000.htm
---
# Autodesk.Revit.DB.FailureSeverity.Warning

**中文**: 警告

Failure that can be ignored by end-user. Failures of this severity do not prevent transactions from being committed.